subdivisions: list[str] = ['Отдел Java разработки',
                           'Отдел Python разработки',
                           'Отдел .NET разработки',
                           'Отдел frontend разработки',
                           'Отдел PHP разработки',
                           'Отдел Android разработки',
                           'Отдел IOS разработки']

job_titles: list[str] = ['Начальник подразделения',
                         'Senior разработчик',
                         'Middle разработчик',
                         'Junior разработчик',
                         'Стажер']

gender: list[str] = ['Мужской',
                     'Женский']

male_first_name: list[str] = ['Алексей', 'Андрей', 'Артем', 'Виктор',
                              'Никита', 'Даниил', 'Денис', 'Егор', 'Игорь',
                              'Лев', 'Леонид', 'Павел', 'Петр', 'Роман', 'Руслан',
                              'Сергей', 'Семён', 'Тимофей']

male_last_name: list[str] = ['Иванов', 'Смирнов', 'Кузнецов', 'Попов', 'Васильев', 'Петров',
                             'Соколов', 'Михайлов', 'Новиков', 'Фёдоров', 'Морозов', 'Волков',
                             'Алексеев', 'Лебедев', 'Семенов', 'Егоров', 'Павлов', 'Козлов', 'Степанов',
                             'Николаев', 'Орлов', 'Андреев', 'Макаров', 'Никитин', 'Захаров', 'Калачев',
                             'Грибов', 'Елизаров']

male_middle_name: list[str] = ['Александрович', 'Алексеевич', 'Анатольевич', 'Андреевич', 'Антонович',
                               'Аркадьевич', 'Богданович', 'Борисович', 'Вадимович', 'Валентинович',
                               'Валериевич', 'Васильевич', 'Данилович', 'Денисович', 'Дмитриевич',
                               'Евгеньевич', 'Егорович', 'Геннадиевич', 'Георгиевич', 'Иванович',
                               'Игоревич', 'Николаевич', 'Семенович', 'Сергеевич']

female_first_name: list[str] = ['Кира', 'Виктория', 'Тамара', 'Милана', 'Анастасия', 'Лидия', 'Екатерина', 'Ангелина',
                                'Вера', 'Зоя', 'Маргарита', 'Лилия', 'Елизавета', 'Яна', 'Юлия', 'Елена', 'Надежда', 'Наталия',
                                'Татьяна', 'Тамара', 'Василиса', 'Людмила',' Александра', 'София']

female_last_name: list[str] = ['Иванова', 'Смирнова', 'Кузнецова', 'Попова', 'Васильева', 'Петрова',
                               'Соколова', 'Михайлова', 'Новикова', 'Фёдорова', 'Морозова', 'Волкова',
                               'Алексеева', 'Лебедева', 'Семенова', 'Егорова', 'Павлова', 'Козлова', 'Степанова',
                               'Николаева', 'Орлова', 'Андреева', 'Макарова', 'Никитина', 'Захарова', 'Калачева',
                               'Грибова', 'Елизарова']

female_middle_name: list[str] = ['Александровна', 'Алексеевна', 'Анатольевна', 'Андреевна', 'Антоновна',
                                 'Аркадьевна', 'Богдановна', 'Борисовна', 'Вадимовна', 'Валентиновна',
                                 'Валериевна', 'Васильевна', 'Даниловна', 'Денисовна', 'Дмитриевна',
                                 'Евгеньевна', 'Егоровна', 'Геннадиевна', 'Георгиевна', 'Ивановна',
                                 'Игоревна', 'Николаевна', 'Семеновна', 'Сергеевна']
